openfoamplatoons/assets/foam/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

flowVelocity         ($flowVelocityX 0 0);
pressure             0;
turbulentKE          $turbulentKE;
turbulentOmega       $turbulentOmega;

// ************************************************************************* //
